/*jshint strict:false*/

var term = require('../term.js');
var assert = require('assert');

var test = function test(input, from, to) {

	var output;

	try {
		output = term(input);

	} catch (e) {
		if (from) {
			throw e;
		} else {
			return; // error発生が正常時
		}
	}

	assert(output[0].getTime() === new Date(from).getTime());
	assert(output[1].getTime() === new Date(to).getTime());
};

var i,f,t;

i = '昨日';
test(i, false);

i = '2000年';
f = '2000-01-01 00:00:00.000';
t = '2000-12-31 23:59:59.999';
test(i,f,t);

i = '2000年10月';
f = '2000-10-01 00:00:00.000';
t = '2000-10-31 23:59:59.999';
test(i,f,t);

i = '2000年10月1日';
f = '2000-10-01 00:00:00.000';
t = '2000-10-01 23:59:59.999';
test(i,f,t);

i = '2000年10月1日 12時';
f = '2000-10-01 12:00:00.000';
t = '2000-10-01 12:59:59.999';
test(i,f,t);

i = '2000年10月1日 12時34分';
f = '2000-10-01 12:34:00.000';
t = '2000-10-01 12:34:59.999';
test(i,f,t);

i = '2000年10月1日 12時34分56秒';
f = '2000-10-01 12:34:56.000';
t = '2000-10-01 12:34:56.999';
test(i,f,t);

i = ['昨日', '今日'];
test(i, false);

i = ['2000-1-1', '今日'];
test(i, false);

i = ['今日', '2001-1-1'];
test(i, false);

i = ['2000年', '2001年'];
f = '2000-01-01 00:00:00.000';
t = '2001-12-31 23:59:59.999';
test(i,f,t);

i = ['2000年1月', '2000年4月'];
f = '2000-01-01 00:00:00.000';
t = '2000-04-30 23:59:59.999';
test(i,f,t);

i = ['2000年1月1日', '2000年1月5日'];
f = '2000-01-01 00:00:00.000';
t = '2000-01-05 23:59:59.999';
test(i,f,t);

i = ['2000年1月1日 10時', '2000年1月1日 13時'];
f = '2000-01-01 10:00:00.000';
t = '2000-01-01 12:59:59.999';
test(i,f,t);

i = ['2000年1月1日 10時10分', '2000年1月1日 13時13分'];
f = '2000-01-01 10:10:00.000';
t = '2000-01-01 13:12:59.999';
test(i,f,t);

i = ['2000年1月1日 10時10分10秒', '2000年1月1日 13時13分13秒'];
f = '2000-01-01 10:10:10.000';
t = '2000-01-01 13:13:12.999';
test(i,f,t);

console.log('test ok');